from django.db import models
from apps.users.models import User
from apps.common.models import BaseModel


BANK_CODES = [
    ("000", "알수없음"),
    ("001", "한국은행"),
    ("002", "산업은행"),
    ("003", "기업은행"),
    ("004", "국민은행"),
    ("005", "외환은행"),
    ("007", "수협중앙회"),
    ("008", "수출입은행"),
    ("011", "농협은행"),
    ("012", "지역농.축협"),
    ("020", "우리은행"),
    ("023", "SC은행"),
    ("027", "한국씨티은행"),
    ("031", "대구은행"),
    ("032", "부산은행"),
    ("034", "광주은행"),
    ("035", "제주은행"),
    ("037", "전북은행"),
    ("039", "경남은행"),
    ("045", "새마을금고중앙회"),
    ("048", "신협중앙회"),
    ("050", "상호저축은행"),
    ("051", "중국은행"),
    ("052", "모건스탠리은행"),
    ("054", "HSBC은행"),
    ("055", "도이치은행"),
    ("056", "알비에스피엘씨은행"),
    ("057", "제이피모간체이스은행"),
    ("058", "미즈호은행"),
    ("059", "미쓰비시도쿄UFJ은행"),
    ("060", "BOA은행"),
    ("061", "비엔피파리바은행"),
    ("062", "중국공상은행"),
    ("063", "중국은행"),
    ("064", "산림조합중앙회"),
    ("065", "대화은행"),
    ("066", "교통은행"),
    ("071", "우체국"),
    ("076", "신용보증기금"),
    ("077", "기술보증기금"),
    ("081", "KEB하나은행"),
    ("088", "신한은행"),
    ("089", "케이뱅크"),
    ("090", "카카오뱅크"),
    ("092", "토스뱅크"),
    ("093", "한국주택금융공사"),
    ("094", "서울보증보험"),
    ("095", "경찰청"),
    ("096", "한국전자금융(주)"),
    ("099", "금융결제원"),
    ("102", "대신저축은행"),
    ("103", "에스비아이저축은행"),
    ("104", "에이치케이저축은행"),
    ("105", "웰컴저축은행"),
    ("106", "신한저축은행"),
    ("209", "유안타증권"),
    ("218", "현대증권"),
    ("221", "골든브릿지투자증권"),
    ("222", "한양증권"),
    ("223", "리딩투자증권"),
    ("224", "BNK투자증권"),
    ("225", "IBK투자증권"),
    ("226", "KB투자증권"),
    ("227", "KTB투자증권"),
    ("230", "미래에셋증권"),
    ("238", "대우증권"),
    ("240", "삼성증권"),
    ("243", "한국투자증권"),
    ("261", "교보증권"),
    ("262", "하이투자증권"),
    ("263", "HMC투자증권"),
    ("264", "키움증권"),
    ("265", "이베스트투자증권"),
    ("266", "SK증권"),
    ("267", "대신증권"),
    ("269", "한화투자증권"),
    ("270", "하나대투증권"),
    ("278", "신한금융투자"),
    ("279", "DB금융투자"),
    ("280", "유진투자증권"),
    ("287", "메리츠종합금융증권"),
    ("289", "NH투자증권"),
    ("290", "부국증권"),
    ("291", "신영증권"),
    ("292", "엘아이지투자증권"),
    ("293", "한국증권금융"),
    ("294", "펀드온라인코리아"),
    ("295", "우리종합금융"),
    ("296", "삼성선물"),
    ("297", "외환선물"),
    ("298", "현대선물"),
]

ACCOUNT_TYPE_CHOICES = [
    ("CHECKING", "입출금"),
    ("SAVING", "적금"),
    ("LOAN", "대출"),
    ("PENSION", "연금"),
    ("TRUST", "신탁"),
    ("FOREIGN_CURRENCY", "외화"),
    ("IRP", "퇴직연금"),
    ("STOCK", "주식"),
]


class Account(BaseModel):
    # 유저 정보
    user = models.ForeignKey(User,
        on_delete=models.CASCADE, # 종속 삭제 옵션. 이 계좌가 참조하는 User가 삭제될 경우, 이 Account 데이터도 함께 자동으로 삭제됨.
        related_name='accounts', # 역참조 시 사용할 이름. user 객체에서 이 사용자가 소유한 모든 계좌에 접근하고 싶을 때, user.accounts.all()과 같은 직관적인 코드를 사용할 수 있게 해줌.
        verbose_name='사용자'
    )
    # 계좌 번호
    account_number = models.CharField(max_length=50, unique=True, verbose_name='계좌번호')
    # 은행 코드
    bank_code = models.CharField(max_length=10, choices=BANK_CODES, verbose_name='은행 코드')
    # 계좌 종류
    account_type = models.CharField(max_length=20, choices=ACCOUNT_TYPE_CHOICES, verbose_name='계좌 종류')
    # 잔액 (소수점 포함 가능성 있기에 DecimalField 사용)
    balance = models.DecimalField(max_digits=15, decimal_places=2, default=0.00, verbose_name='잔액')

    class Meta:
        verbose_name = '계좌'
        verbose_name_plural = '계좌 목록'
        unique_together = ('user', 'account_number')

    def __str__(self):
        # 이 Account 객체를 사람이 알아보기 쉬운 문자열로 표현
        # Django 관리자 페이지나 디버깅 시, Account object(2)와 같이 알아보기 힘든 표현 대신
        # '홍길동의 국민은행 계좌 (123-456)'와 같이 훨씬 명확한 형태로 객체를 표시한다.
        return f'{self.user.nickname}의 {self.get_bank_code_display()} 계좌 ({self.account_number})'
